OpenFOAM files/run/city/3_7m:s/LoD2/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "2";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    x0
    {
        type            symmetry;
    }
    y0
    {
        type            zeroGradient;
    }
    x1
    {
        type            symmetry;
    }
    y1
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           uniform 0;
    }
    water
    {
        type            zeroGradient;
    }
    sky
    {
        type            symmetry;
    }
    Buildings
    {
        type            zeroGradient;
    }
    Terrain
    {
        type            zeroGradient;
    }
    Treetrunk
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
